---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RoomFailures.RoomBaseAboveComputationHeight
source: html/e55251f0-3607-538f-1649-e225e24f8129.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RoomFailures.RoomBaseAboveComputationHeight Property

[RoomBase]'s lower offset is above the Computation Height

## Syntax (C#)
```csharp
public static FailureDefinitionId RoomBaseAboveComputationHeight { get; }
```